阿尔巴尼亚集成电路布图设计法（1999）阿尔巴尼亚语
阿尔巴尼亚集成电路布图设计法（2008）阿尔巴尼亚语
阿尔巴尼亚版权法（2016）阿尔巴尼亚语
阿富汗商标法 (2009)波斯语
阿富汗专利法普什图语
阿富汗版权法 (2008)普什图语
阿联酋版权法（2002）阿拉伯语
阿联酋植物新品种法（2009）阿拉伯语
阿联酋商标法（1992）阿拉伯语
阿塞拜疆集成电路布图设计法 (2008)阿塞拜疆语
阿塞拜疆商标法 (2010)阿塞拜疆语
阿塞拜疆商标法 (2010)俄语
阿塞拜疆植物新品种法 (2007)阿塞拜疆语
阿塞拜疆专利法 (2009)阿塞拜疆语
阿塞拜疆专利法 (2009)俄语
埃及知识产权法 (2002)阿拉伯语
爱沙尼亚版权法 (2016)爱沙尼亚语
爱沙尼亚地理标志法(2015)爱沙尼亚语
爱沙尼亚集成电路布图设计法 (2015)爱沙尼亚语
爱沙尼亚专利法(2015)爱沙尼亚语
巴林地理标志法 (2004)阿拉伯语
巴林集成电路布图设计法 (2006)阿拉伯语
巴林地理标志法 (2006)阿拉伯语
巴林版权法 (2006)阿拉伯语
白俄罗斯集成电路布图设计法 (2011)俄语
白俄罗斯商标法 (2012)俄语
白俄罗斯商标法 (2000)俄语
白俄斯植物新品种法 (2014)俄语
白俄罗斯版权法(2011)俄语
保加利亚版权法(2011)保加利亚语
保加利亚集成电路布图设计法 (2006)保加利亚语
保加利亚商标和地理标志法 (2011)保加利亚语
保加利亚植物新品种法 (2010)保加利亚语
波黑版权法 (2010)波什尼亚语
波黑版权法 (2010)克罗地亚语
波黑版权法 (2010)塞尔维亚语
波黑地理标志法 (2010)波什尼亚
波黑地理标志法 (2010)克罗地亚
波黑地理标志法 (2010)塞尔维亚
波黑集成电路布图设计法 (2010)波什尼亚
波黑集成电路布图设计法 (2010)克罗地亚
波黑集成电路布图设计法 (2010)塞尔维亚
波黑商标法 (2010)波什尼亚
波黑商标法 (2010)克罗地亚
波黑商标法 (2010)塞尔维亚
波黑植物新品种法 (2004)波什尼亚语
波黑专利法 (2010)波什尼亚
波黑专利法 (2010)克罗地亚
波黑专利法 (2010)塞尔维亚
波兰商标法(1994)波兰语
不丹版权法(2001)不丹语
格鲁吉亚集成电路布图设计法 (1999)格鲁吉亚语
格鲁吉亚专利法 (2010)格鲁吉亚语
格鲁吉亚版权法 (2010)格鲁吉亚语
黑山商标法(2010)塞尔维亚语
黑山集成电路布图设计(2010)塞尔维亚语
黑山版权法(2011)塞尔维亚语
黑山商标法(2014)塞尔威亚语
黑山地理标志法 (2011)塞尔维亚语
吉尔吉斯斯坦集成电路布图设计法(2007)俄语
吉尔吉斯斯坦集成电路布图设计法 (2007)吉尔吉斯斯坦语
吉尔吉斯斯坦植物新品种法(2006)俄语
吉尔吉斯斯坦植物新品种法 (2006)吉尔吉斯斯坦语
捷克集成电路布图设计保护法 (2006)捷克语
捷克植物新品种法(2000)捷克语
捷克地理标志法(2001)捷克语
捷克商标法(2003)捷克语
科威特商标法(2001)阿拉伯语
黎巴嫩商标法 (2005)阿拉伯语
黎巴嫩专利法(2000)阿拉伯语
立陶宛专利法 (2007)立陶宛语
立陶宛集成电路布图设计法(2006)立陶宛语
立陶宛商标法(2006)立陶宛语
罗马尼亚集成电路布图设计法 (2006)罗马尼亚语
罗马尼亚版权法 (2006)罗马尼亚语
罗马尼亚专利法(1998)罗马尼亚语
罗马尼亚商标和地理标志法(2010)罗马尼亚语
马尔代夫版权法 (2010)迪维希语
马其顿版权法(2011)马其顿语
马其顿集成电路布图设计法 (2006)马其顿语
蒙古商标和地理标志法 (2010)咯尔咯蒙古语
孟加拉版权法(2005)孟加拉语
摩尔多瓦商标法(2016)俄语
摩尔多瓦商标法(2016)罗马尼亚语
摩尔多瓦地理标志法(2016)俄语
摩尔多瓦地理标志法(2016)罗马尼亚语
摩尔多瓦版权法(2016)俄语
摩尔多瓦版权法(2016)罗马尼亚语
摩尔多瓦集成电路布图设计法(2016)俄语
摩尔多瓦集成电路布图设计法(2016)罗马尼亚语
塞浦路斯版权法 (1999)希腊语
塞浦路斯版权法 (2001)希腊语
塞浦路斯版权法(1993)法语
塞浦路斯版权法(2002)希腊语
塞浦路斯版权法(2004)希腊语
塞浦路斯版权法(2006)希腊语
塞浦路斯版权法(2007)希腊语
塞浦路斯集成电路布图设计法(2002)希腊语
塞浦路斯地理标志法(2010)希腊语
塞浦路斯地理标志法(2006)希腊语
塞浦路斯商标法(1990)希腊语
塞浦路斯商标法(2000)希腊语
塞浦路斯植物新品种法(2004)希腊语
塞浦路斯专利法(1999)希腊语
塞浦路斯专利法(2000)希腊语
塞浦路斯专利法(2002)希腊语
塞浦路斯专利法(2006)希腊语
塞浦路斯专利法(1998)法语
沙特阿拉伯商标法  (2002)阿拉伯语
沙特阿拉伯集成电路布图设计法(2004)阿拉伯语
斯洛伐克植物新品种法 (2009)斯洛伐克语
斯洛伐克集成电路布图设计法 (2007)斯洛伐克语
斯洛伐克地理标志法(2007)斯洛伐克语
斯洛伐克专利法(2001)斯洛伐克语
斯洛伐克专利法(2009)斯洛伐克语
斯洛伐克地理标志法 (2009)斯洛伐克语
斯洛伐克植物新品种法 (2011)斯洛伐克语
斯洛文尼亚版权法 (2016)斯洛文尼亚语
塔吉克斯坦集成电路布图设计法 (2006)俄语
塔吉克斯坦集成电路布图设计法 (2006)塔吉克语
塔吉克斯坦植物新品种法 (2010)俄语
塔吉克斯坦植物新品种法 (2010)塔吉克语
泰国版权法  (1995)法语
泰国专利法(1999)泰语
土耳其集成电路布图设计法 (2008)土耳其语
土耳其地理标志法(2008)土耳其语
土耳其商标法 (2009)土耳其语
土耳其植物新品种法(2008)土耳其语
土库曼斯坦集成电路布图设计法 (2013)俄语
土库曼斯坦集成电路布图设计法 (2013)土库曼语
土库曼斯坦商标法 (2013)俄语
土库曼斯坦商标法 (2013)土库曼语
土库曼斯坦植物新品种法 (2011)俄语
土库曼斯坦版权法 (2012)俄语
乌克兰植物新品种法 (2014)乌克兰语
乌克兰商标法 (2012)乌克兰语
乌克兰版权法 (2012)乌克兰语
乌克兰集成电路布图设计法 (2012)乌克兰语
乌兹别克斯坦版权法 (2006)俄语
乌兹别克斯坦版权法 (2006)乌兹别克斯坦语
乌兹别克斯坦植物新品种法 (2002)俄语
乌兹别克斯坦植物新品种法 (2002)乌兹别克斯坦语
匈牙利版权法 (2007)匈牙利语
叙利亚商标法(2007)阿拉伯语
叙利亚版权法 (2001)阿拉伯语
亚美尼亚电路布图设计保护法 (1998)俄语
亚美尼亚电路布图设计保护法 (1998)法语
也门商标和地理标志法 (2010)阿拉伯语
也门集成电路布图设计法 (2011)阿拉伯语
伊拉克商标法 (1938)阿拉伯语
伊拉克商标法 (1957)阿拉伯语
伊拉克专利法(1999)阿拉伯语
伊拉克商标法 (2010)阿拉伯语
以色列商标法 (2010)希伯来语
以色列专利法 (2011)希伯来语
以色列专利法 (2014)希伯来语
印度版权法(1999)法语
印度专利法 (1999)法语
印度专利法 (2002)法语
印度专利法 (2005)法语
印度尼西亚专利法 (1997)印尼语
印度尼西亚集成电路布图设计 (2000)印尼语
印度尼西亚商标法(2001)印尼语
印度尼西亚植物新品种法 (2000)印尼语
约旦集成电路布图设计法(2000)阿拉伯语
约旦植物新品种法 (2000)阿拉伯语
约旦专利法(2001)阿拉伯语
约旦专利法 (2007)阿拉伯语
约旦商标法(2007)阿拉伯语
约旦商标法 (2008)阿拉伯语
约旦地理标志法 (2000)阿拉伯语
约旦商标法(1999)阿拉伯语
约旦专利法 (1999)阿拉伯语
约旦商标法(1953)阿拉伯语
约旦商标法 (1952)法语
约旦商标法(1952)阿拉伯语
新加坡专利法(2012)英语
新加坡版权法 (2006)英语
新加坡集成电路布图设计法(1999)英语
新加坡商标法 (2005)英语